// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

Console.Clear();
Console.Write("Введите число" );
string str = Console.ReadLine();
Console.WriteLine( str[2]);

